// 28097: 모범생 포닉스
//
// - 문제
// 모두가 알다시피, 포닉스는 포스텍을 대표하는 모범생이다! 포닉스는 최고의 모범생답게 남들과는 다른 공부 계획표를 가지고 있다.
// 포닉스는 총 $N$개의 공부 계획을 가지고 있다. $i$번째 공부 계획을 실행하는 데에는 $T_i$시간이 소모된다. 포닉스는 각 계획을 순서대로 시행하며, 각 계획 사이에는 $8$시간만큼의 휴식을 취한다.
// $N$개의 공부 계획을 모두 마친 포닉스는 지금의 시간이 첫 번째 공부 계획을 시작한 시간으로부터 얼마나 지났는지 궁금해졌다. 포닉스가 마지막 공부를 마칠 때까지 걸린 총 시간이 며칠 몇 시간인지 구해 보자. $1$일은 $24$시간이다.
//
// - 입력
// 첫 번째 줄에 공부 계획의 수 $N$이 주어진다. ($1\le N\le 120$)
// 두 번째 줄에 각 계획의 공부 시간을 나타내는 $N$개의 정수 $T_1,T_2,\ldots ,T_N$이 공백으로 구분되어 주어진다. ($10\leq T_i\leq 30$)
//
// - 출력
// 모든 계획을 마친 후의 소요 시간을 일과 시간 단위로 공백으로 구분하여 출력한다.

#include <bits/stdc++.h>
using namespace std;

int main() {
  ios::sync_with_stdio(0);
  cin.tie(0);
  int n, x;
  cin >> n;
  int h = 8 * (n - 1);
  while (n--) {
    cin >> x;
    h += x;
  }
  cout << h / 24 << ' ' << h % 24;
  return 0;
}
