// 18096: Арифметическая магия
//
// - 문제
// Дэвид Блейн попросил зрителя задумать два числа.  Затем он попросил перемножить два числа, большие каждого из задуманных на единицу,  вычесть из результата сначала одно задуманное число, затем другое, а затем --- их произведение, а полученный результат возвести в N-ю степень.
// После чего Дэвид внимательно вгляделся в лицо зрителя и правильно назвал получившийся результат. Ваша задача --- повторить фокус Дэвида. По заданному N угадайте получившееся у зрителя число.
//
// - 입력
// Входные данные содержат одно целое число N (0 ≤ N ≤ 1000).
//
// - 출력
// Выведите одно число --- получившийся у зрителя результат.

#include <bits/stdc++.h>
using namespace std;

int main() {
  ios::sync_with_stdio(0);
  cin.tie(0);
  int n;
  cin >> n;
  cout << 1;
  return 0;
}