// 24087: アイスクリーム (Ice Cream)
//
// - 문제
// JOI アイスクリーム店は，非常に高さのあるアイスクリームタワーが名物のアイスクリーム店である．アイスクリームタワーとは，ベースとなるアイスクリームの上に，追加のアイスクリームを 0 個以上積み重ねたものである．
// ベースとなるアイスクリームの金額は 250 円で，高さは A cm である．追加のアイスクリームは 1 個につき 100 円で，1 個追加するごとにアイスクリームタワーの高さが B cm 増える．
// あなたは，この店で高さが S cm 以上のアイスクリームタワーを買いたい．高さが S cm 以上のアイスクリームタワーを買うために必要な金額の最小値を求めよ．
//
// - 입력
// 入力は以下の形式で標準入力から与えられる．
// S
// A
// B
//
// - 출력
// 高さ S cm 以上のアイスクリームタワーを買うために必要な金額の最小値を，単位 (円) を省いて出力せよ．
//
// - 제한
// 1 ≦ S ≦ 100．
// 1 ≦ A ≦ 100．
// 1 ≦ B ≦ 100．
// 入力される値はすべて整数である．

#include <bits/stdc++.h>
using namespace std;

int main() {
  ios::sync_with_stdio(0);
  cin.tie(0);
  int s, a, b, ans = 250;
  cin >> s >> a >> b;
  while (a < s) {
    a += b;
    ans += 100;
  }
  cout << ans;
  return 0;
}